app/views/homepage/index.html.haml

  %tbody
    - current_user.books.each do |b|
---
SELECT `books`.* FROM `books` WHERE `books`.`user_id` = 1