app/views/books/_index.html.haml

SELECT COUNT(*) FROM `books` WHERE `books`.`user_id` = 3
SELECT `books`.* FROM `books` WHERE `books`.`user_id` = 1
---

- if !current_user.books.any?