app/controllers/books_controller.rb

  def index
    @books = Book.paginate(:page => params[:page]||1)
---
SELECT `books`.* FROM `books`

  def create
    @book = Book.new(params[:book])
    @book.user = current_user
    if @book.save
---
INSERT INTO `books` (`author`, `created_at`, `published_at`, `title`, `updated_at`, `user_id`) VALUES ('OSC', '2012-04-25 23:22:42', '1990-04-25 00:00:00', 'Ender\'s Game', '2012-04-25 23:22:42', 1)

  def update
    @book = Book.find(params[:id])

    if @book.update_attributes(params[:book])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 9 LIMIT 1
UPDATE `books` SET `published_at` = '1985-04-25 00:00:00', `updated_at` = '2012-04-25 23:23:09' WHERE `books`.`id` = 1